# MultiReferenceAnnotationReferenceCategory Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MultiReferenceAnnotationReferenceCategory Property
ParameterTypeId Class See Also
---
"Reference Category"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MultiReferenceAnnotationReferenceCategory { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MultiReferenceAnnotationReferenceCategory As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MultiReferenceAnnotationReferenceCategory {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace